docker-final/docker-redis/context/lasttest/redis_benchmark_results.txt
====== SET ======
  100000 requests completed in 1.18 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.175 milliseconds (cumulative count 2)
50.000% <= 0.279 milliseconds (cumulative count 51216)
75.000% <= 0.375 milliseconds (cumulative count 76427)
87.500% <= 0.415 milliseconds (cumulative count 88308)
93.750% <= 0.455 milliseconds (cumulative count 94262)
96.875% <= 0.519 milliseconds (cumulative count 96904)
98.438% <= 0.639 milliseconds (cumulative count 98439)
99.219% <= 0.783 milliseconds (cumulative count 99243)
99.609% <= 1.047 milliseconds (cumulative count 99615)
99.805% <= 1.311 milliseconds (cumulative count 99805)
99.902% <= 1.599 milliseconds (cumulative count 99906)
99.951% <= 2.023 milliseconds (cumulative count 99953)
99.976% <= 3.287 milliseconds (cumulative count 99977)
99.988% <= 3.335 milliseconds (cumulative count 99988)
99.994% <= 3.359 milliseconds (cumulative count 99996)
99.997% <= 3.375 milliseconds (cumulative count 99998)
99.998% <= 3.383 milliseconds (cumulative count 99999)
99.999% <= 3.399 milliseconds (cumulative count 100000)
100.000% <= 3.399 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.071% <= 0.207 milliseconds (cumulative count 71)
62.187% <= 0.303 milliseconds (cumulative count 62187)
86.203% <= 0.407 milliseconds (cumulative count 86203)
96.501% <= 0.503 milliseconds (cumulative count 96501)
98.169% <= 0.607 milliseconds (cumulative count 98169)
98.877% <= 0.703 milliseconds (cumulative count 98877)
99.286% <= 0.807 milliseconds (cumulative count 99286)
99.461% <= 0.903 milliseconds (cumulative count 99461)
99.578% <= 1.007 milliseconds (cumulative count 99578)
99.665% <= 1.103 milliseconds (cumulative count 99665)
99.732% <= 1.207 milliseconds (cumulative count 99732)
99.796% <= 1.303 milliseconds (cumulative count 99796)
99.854% <= 1.407 milliseconds (cumulative count 99854)
99.870% <= 1.503 milliseconds (cumulative count 99870)
99.909% <= 1.607 milliseconds (cumulative count 99909)
99.925% <= 1.703 milliseconds (cumulative count 99925)
99.938% <= 1.807 milliseconds (cumulative count 99938)
99.944% <= 1.903 milliseconds (cumulative count 99944)
99.951% <= 2.007 milliseconds (cumulative count 99951)
99.963% <= 2.103 milliseconds (cumulative count 99963)
99.974% <= 3.103 milliseconds (cumulative count 99974)
100.000% <= 4.103 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 84388.19 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.320     0.168     0.279     0.471     0.727     3.399
====== GET ======
  100000 requests completed in 1.45 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 2)
50.000% <= 0.343 milliseconds (cumulative count 51288)
75.000% <= 0.399 milliseconds (cumulative count 76605)
87.500% <= 0.463 milliseconds (cumulative count 87670)
93.750% <= 0.559 milliseconds (cumulative count 93928)
96.875% <= 0.671 milliseconds (cumulative count 96889)
98.438% <= 0.807 milliseconds (cumulative count 98466)
99.219% <= 1.007 milliseconds (cumulative count 99231)
99.609% <= 1.295 milliseconds (cumulative count 99610)
99.805% <= 1.895 milliseconds (cumulative count 99806)
99.902% <= 2.751 milliseconds (cumulative count 99903)
99.951% <= 4.719 milliseconds (cumulative count 99952)
99.976% <= 6.111 milliseconds (cumulative count 99979)
99.988% <= 6.143 milliseconds (cumulative count 99989)
99.994% <= 6.159 milliseconds (cumulative count 99995)
99.997% <= 6.167 milliseconds (cumulative count 99997)
99.998% <= 6.191 milliseconds (cumulative count 99999)
99.999% <= 11.087 milliseconds (cumulative count 100000)
100.000% <= 11.087 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.043% <= 0.207 milliseconds (cumulative count 43)
25.362% <= 0.303 milliseconds (cumulative count 25362)
78.849% <= 0.407 milliseconds (cumulative count 78849)
91.109% <= 0.503 milliseconds (cumulative count 91109)
95.432% <= 0.607 milliseconds (cumulative count 95432)
97.407% <= 0.703 milliseconds (cumulative count 97407)
98.466% <= 0.807 milliseconds (cumulative count 98466)
98.985% <= 0.903 milliseconds (cumulative count 98985)
99.231% <= 1.007 milliseconds (cumulative count 99231)
99.403% <= 1.103 milliseconds (cumulative count 99403)
99.513% <= 1.207 milliseconds (cumulative count 99513)
99.612% <= 1.303 milliseconds (cumulative count 99612)
99.673% <= 1.407 milliseconds (cumulative count 99673)
99.709% <= 1.503 milliseconds (cumulative count 99709)
99.745% <= 1.607 milliseconds (cumulative count 99745)
99.766% <= 1.703 milliseconds (cumulative count 99766)
99.782% <= 1.807 milliseconds (cumulative count 99782)
99.807% <= 1.903 milliseconds (cumulative count 99807)
99.833% <= 2.007 milliseconds (cumulative count 99833)
99.856% <= 2.103 milliseconds (cumulative count 99856)
99.924% <= 3.103 milliseconds (cumulative count 99924)
99.964% <= 5.103 milliseconds (cumulative count 99964)
99.975% <= 6.103 milliseconds (cumulative count 99975)
99.999% <= 7.103 milliseconds (cumulative count 99999)
100.000% <= 11.103 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 69204.15 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.377     0.112     0.343     0.599     0.911    11.087