docker-final/docker-redis/context/lasttest/redis_benchmark_results.txt
====== SET ======
  100000 requests completed in 1.50 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.479 milliseconds (cumulative count 51188)
75.000% <= 0.687 milliseconds (cumulative count 75418)
87.500% <= 1.095 milliseconds (cumulative count 87485)
93.750% <= 1.983 milliseconds (cumulative count 93725)
96.875% <= 5.631 milliseconds (cumulative count 96827)
98.438% <= 27.103 milliseconds (cumulative count 98389)
99.219% <= 42.815 milliseconds (cumulative count 99175)
99.609% <= 47.295 milliseconds (cumulative count 99560)
99.805% <= 50.527 milliseconds (cumulative count 99755)
99.902% <= 51.647 milliseconds (cumulative count 99853)
99.951% <= 52.287 milliseconds (cumulative count 99903)
99.976% <= 52.767 milliseconds (cumulative count 99926)
99.988% <= 53.791 milliseconds (cumulative count 99938)
99.994% <= 54.047 milliseconds (cumulative count 99944)
99.997% <= 54.271 milliseconds (cumulative count 99947)
99.998% <= 54.335 milliseconds (cumulative count 99949)
99.999% <= 54.367 milliseconds (cumulative count 99950)
100.000% <= 54.367 milliseconds (cumulative count 99950)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.047% <= 0.207 milliseconds (cumulative count 47)
13.806% <= 0.303 milliseconds (cumulative count 13799)
32.228% <= 0.407 milliseconds (cumulative count 32212)
56.069% <= 0.503 milliseconds (cumulative count 56041)
69.566% <= 0.607 milliseconds (cumulative count 69531)
76.357% <= 0.703 milliseconds (cumulative count 76319)
81.187% <= 0.807 milliseconds (cumulative count 81146)
84.167% <= 0.903 milliseconds (cumulative count 84125)
86.138% <= 1.007 milliseconds (cumulative count 86095)
87.629% <= 1.103 milliseconds (cumulative count 87585)
88.931% <= 1.207 milliseconds (cumulative count 88887)
89.921% <= 1.303 milliseconds (cumulative count 89876)
90.843% <= 1.407 milliseconds (cumulative count 90798)
91.471% <= 1.503 milliseconds (cumulative count 91425)
92.059% <= 1.607 milliseconds (cumulative count 92013)
92.539% <= 1.703 milliseconds (cumulative count 92493)
93.056% <= 1.807 milliseconds (cumulative count 93009)
93.452% <= 1.903 milliseconds (cumulative count 93405)
93.848% <= 2.007 milliseconds (cumulative count 93801)
94.159% <= 2.103 milliseconds (cumulative count 94112)
95.822% <= 3.103 milliseconds (cumulative count 95774)
96.447% <= 4.103 milliseconds (cumulative count 96399)
96.746% <= 5.103 milliseconds (cumulative count 96698)
96.963% <= 6.103 milliseconds (cumulative count 96915)
97.124% <= 7.103 milliseconds (cumulative count 97075)
97.228% <= 8.103 milliseconds (cumulative count 97179)
97.393% <= 9.103 milliseconds (cumulative count 97344)
97.461% <= 10.103 milliseconds (cumulative count 97412)
97.642% <= 11.103 milliseconds (cumulative count 97593)
97.866% <= 12.103 milliseconds (cumulative count 97817)
98.042% <= 13.103 milliseconds (cumulative count 97993)
98.212% <= 14.103 milliseconds (cumulative count 98163)
98.280% <= 15.103 milliseconds (cumulative count 98231)
98.285% <= 16.103 milliseconds (cumulative count 98236)
98.321% <= 20.111 milliseconds (cumulative count 98272)
98.335% <= 21.103 milliseconds (cumulative count 98286)
98.344% <= 23.103 milliseconds (cumulative count 98295)
98.369% <= 24.111 milliseconds (cumulative count 98320)
98.379% <= 26.111 milliseconds (cumulative count 98330)
98.438% <= 27.103 milliseconds (cumulative count 98389)
98.497% <= 28.111 milliseconds (cumulative count 98448)
98.515% <= 29.103 milliseconds (cumulative count 98466)
98.535% <= 30.111 milliseconds (cumulative count 98486)
98.589% <= 32.111 milliseconds (cumulative count 98540)
98.595% <= 33.119 milliseconds (cumulative count 98546)
98.640% <= 34.111 milliseconds (cumulative count 98591)
98.674% <= 35.103 milliseconds (cumulative count 98625)
98.692% <= 36.127 milliseconds (cumulative count 98643)
98.694% <= 37.119 milliseconds (cumulative count 98645)
98.739% <= 40.127 milliseconds (cumulative count 98690)
98.890% <= 41.119 milliseconds (cumulative count 98841)
99.067% <= 42.111 milliseconds (cumulative count 99017)
99.293% <= 43.103 milliseconds (cumulative count 99243)
99.395% <= 44.127 milliseconds (cumulative count 99345)
99.516% <= 45.119 milliseconds (cumulative count 99466)
99.553% <= 46.111 milliseconds (cumulative count 99503)
99.600% <= 47.103 milliseconds (cumulative count 99550)
99.658% <= 48.127 milliseconds (cumulative count 99608)
99.737% <= 49.119 milliseconds (cumulative count 99687)
99.787% <= 50.111 milliseconds (cumulative count 99737)
99.856% <= 51.103 milliseconds (cumulative count 99806)
99.941% <= 52.127 milliseconds (cumulative count 99891)
99.977% <= 53.119 milliseconds (cumulative count 99927)
99.994% <= 54.111 milliseconds (cumulative count 99944)
100.000% <= 55.103 milliseconds (cumulative count 99950)

Summary:
  throughput summary: 66445.18 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        1.457     0.112     0.479     2.447    41.663    54.367
====== GET ======
  100000 requests completed in 3.90 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.095 milliseconds (cumulative count 1)
50.000% <= 0.471 milliseconds (cumulative count 50962)
75.000% <= 0.679 milliseconds (cumulative count 75156)
87.500% <= 1.023 milliseconds (cumulative count 87548)
93.750% <= 1.719 milliseconds (cumulative count 93764)
96.875% <= 3.319 milliseconds (cumulative count 96886)
98.438% <= 33.311 milliseconds (cumulative count 98439)
99.219% <= 39.519 milliseconds (cumulative count 99222)
99.609% <= 41.439 milliseconds (cumulative count 99613)
99.805% <= 43.263 milliseconds (cumulative count 99807)
99.902% <= 44.223 milliseconds (cumulative count 99904)
99.951% <= 45.183 milliseconds (cumulative count 99952)
99.976% <= 46.975 milliseconds (cumulative count 99976)
99.988% <= 47.391 milliseconds (cumulative count 99988)
99.994% <= 47.967 milliseconds (cumulative count 99994)
99.997% <= 48.255 milliseconds (cumulative count 99997)
99.998% <= 48.415 milliseconds (cumulative count 99999)
99.999% <= 48.447 milliseconds (cumulative count 100000)
100.000% <= 48.447 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
0.002% <= 0.103 milliseconds (cumulative count 2)
0.008% <= 0.207 milliseconds (cumulative count 8)
6.820% <= 0.303 milliseconds (cumulative count 6820)
38.018% <= 0.407 milliseconds (cumulative count 38018)
56.451% <= 0.503 milliseconds (cumulative count 56451)
69.475% <= 0.607 milliseconds (cumulative count 69475)
76.634% <= 0.703 milliseconds (cumulative count 76634)
81.890% <= 0.807 milliseconds (cumulative count 81890)
85.095% <= 0.903 milliseconds (cumulative count 85095)
87.280% <= 1.007 milliseconds (cumulative count 87280)
88.936% <= 1.103 milliseconds (cumulative count 88936)
90.374% <= 1.207 milliseconds (cumulative count 90374)
91.246% <= 1.303 milliseconds (cumulative count 91246)
91.962% <= 1.407 milliseconds (cumulative count 91962)
92.595% <= 1.503 milliseconds (cumulative count 92595)
93.209% <= 1.607 milliseconds (cumulative count 93209)
93.701% <= 1.703 milliseconds (cumulative count 93701)
94.124% <= 1.807 milliseconds (cumulative count 94124)
94.421% <= 1.903 milliseconds (cumulative count 94421)
94.695% <= 2.007 milliseconds (cumulative count 94695)
94.928% <= 2.103 milliseconds (cumulative count 94928)
96.702% <= 3.103 milliseconds (cumulative count 96702)
97.364% <= 4.103 milliseconds (cumulative count 97364)
97.725% <= 5.103 milliseconds (cumulative count 97725)
97.884% <= 6.103 milliseconds (cumulative count 97884)
97.992% <= 7.103 milliseconds (cumulative count 97992)
98.058% <= 8.103 milliseconds (cumulative count 98058)
98.070% <= 9.103 milliseconds (cumulative count 98070)
98.108% <= 10.103 milliseconds (cumulative count 98108)
98.118% <= 11.103 milliseconds (cumulative count 98118)
98.180% <= 12.103 milliseconds (cumulative count 98180)
98.194% <= 13.103 milliseconds (cumulative count 98194)
98.213% <= 26.111 milliseconds (cumulative count 98213)
98.240% <= 27.103 milliseconds (cumulative count 98240)
98.244% <= 28.111 milliseconds (cumulative count 98244)
98.257% <= 30.111 milliseconds (cumulative count 98257)
98.297% <= 31.103 milliseconds (cumulative count 98297)
98.351% <= 32.111 milliseconds (cumulative count 98351)
98.413% <= 33.119 milliseconds (cumulative count 98413)
98.512% <= 34.111 milliseconds (cumulative count 98512)
98.598% <= 35.103 milliseconds (cumulative count 98598)
98.658% <= 36.127 milliseconds (cumulative count 98658)
98.776% <= 37.119 milliseconds (cumulative count 98776)
98.932% <= 38.111 milliseconds (cumulative count 98932)
99.124% <= 39.103 milliseconds (cumulative count 99124)
99.366% <= 40.127 milliseconds (cumulative count 99366)
99.560% <= 41.119 milliseconds (cumulative count 99560)
99.713% <= 42.111 milliseconds (cumulative count 99713)
99.793% <= 43.103 milliseconds (cumulative count 99793)
99.893% <= 44.127 milliseconds (cumulative count 99893)
99.951% <= 45.119 milliseconds (cumulative count 99951)
99.963% <= 46.111 milliseconds (cumulative count 99963)
99.980% <= 47.103 milliseconds (cumulative count 99980)
99.996% <= 48.127 milliseconds (cumulative count 99996)
100.000% <= 49.119 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 25621.32 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        1.336     0.088     0.471     2.135    38.463    48.447